docs/evidence/k6-smoke.txt
======================================================================
หลักฐาน: การรัน smoke test
คำสั่ง: k6 run k6/smoke.js
วันที่รัน: 2026-09-16 14:41:33 +0700
โฟลเดอร์ทำงาน: /Users/ar677005/Documents/AI_workspaces/learns/loadtest-k6
k6: k6 v2.2.0 (commit/devel, go1.26.5, darwin/arm64)
mock server: http://localhost:8080 (สตาร์ทด้วย node mock-server/server.mjs)
ปลายทางที่ยิงจริง: GET http://localhost:8080/api/items

!!! สถานะของไฟล์นี้ (เพิ่มภายหลัง 16 กันยายน 2026) !!!
  ไฟล์นี้บันทึกปัญหา **ก่อนการแก้** — smoke test เวอร์ชันเดิม
  (vus: 1, duration: '10s', เกณฑ์ p(95)<500) ล้มเหลวราว 16% ของการรัน
  เพราะจำนวนตัวอย่างน้อยและ mock server ยังเปิดหางยาว 3% เป็นค่าเริ่มต้น
  **ผลในไฟล์นี้ยังเป็นของจริง ไม่ได้แก้ไข** เก็บไว้เป็นหลักฐานว่าปัญหาเคยมีอยู่
  ผลหลังแก้อยู่ที่ docs/evidence/k6-smoke-repeatability.txt (ผ่าน 30/30)
  และ docs/evidence/k6-load-full.txt
======================================================================

$ curl -s -o /dev/null -w '%{http_code}' http://localhost:8080/health
200

$ k6 run k6/smoke.js


         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/smoke.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 40s max duration (incl. graceful stop):
              * default: 1 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 1 VUs  01.0s/10s

running (02.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  02.0s/10s

running (03.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
default   [  30% ] 1 VUs  03.0s/10s

running (04.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  04.0s/10s

running (05.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
default   [  50% ] 1 VUs  05.0s/10s

running (06.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  06.0s/10s

running (07.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
default   [  70% ] 1 VUs  07.0s/10s

running (08.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  08.0s/10s

running (09.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
default   [  90% ] 1 VUs  09.0s/10s

running (10.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
default   [ 100% ] 1 VUs  10.0s/10s


  █ THRESHOLDS 

    checks
    ✗ 'rate>0.99' rate=96.66%

    http_req_duration
    ✓ 'p(95)<500' p(95)=331.18ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 30     2.769562/s
    checks_succeeded...: 96.66% 29 out of 30
    checks_failed......: 3.33%  1 out of 30

    ✓ สถานะเป็น 200
    ✓ ได้ body กลับมา
    ✗ ตอบภายใน 500 ms
      ↳  90% — ✓ 9 / ✗ 1

    HTTP
    http_req_duration..............: avg=79.39ms min=15.05ms med=24.44ms max=568.04ms p(90)=94.33ms p(95)=331.18ms
      { expected_response:true }...: avg=79.39ms min=15.05ms med=24.44ms max=568.04ms p(90)=94.33ms p(95)=331.18ms
    http_req_failed................: 0.00% 0 out of 10
    http_reqs......................: 10    0.923187/s

    EXECUTION
    iteration_duration.............: avg=1.08s   min=1.01s   med=1.02s   max=1.56s    p(90)=1.09s   p(95)=1.33s   
    iterations.....................: 10    0.923187/s
    vus............................: 1     min=1       max=1
    vus_max........................: 1     min=1       max=1

    NETWORK
    data_received..................: 26 kB 2.4 kB/s
    data_sent......................: 790 B 73 B/s



running (10.8s), 0/1 VUs, 10 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  10s
time="2026-09-16T14:41:45+07:00" level=error msg="thresholds on metrics 'checks' have been crossed"

----------------------------------------------------------------------
exit status: 99

======================================================================
ส่วนเพิ่ม: วัดความเปราะของ smoke test (รันซ้ำหลายครั้ง)
คำสั่ง: for i in $(seq 1 12); do k6 run k6/smoke.js; echo $?; done
วันที่รัน: 2026-09-16 14:41:56 +0700

เหตุผลที่ต้องวัด: การรันด้านบนจบด้วย exit 99 ซึ่งไม่ควรเกิดขึ้นถ้าระบบ
ปลายทางปกติ จึงรันซ้ำเพื่อดูว่าเกิดเป็นครั้งคราวหรือเกิดทุกครั้ง
หมายเหตุ: mock server จงใจให้มีหางยาว 3% ที่บวกเพิ่ม 150-570 ms
          smoke.js ใช้ vus=1 duration=10s และ sleep(1) จึงได้ราว 10 รอบ
          เมื่อมีคำขอเดียวเกิน 500 ms จะทำให้ check และ threshold ล้ม
======================================================================

$ ผลการรันซ้ำ 12 ครั้ง (คอลัมน์ max คือ http_req_duration ค่าสูงสุด)

  run  1: exit=99  FAIL  duration(max=576.61ms p(95)=549.64ms)  
  run  2: exit=0   PASS  duration(max=41.56ms p(95)=41.15ms)  ✓ 'rate>0.99' rate=100.00%
  run  3: exit=0   PASS  duration(max=46.65ms p(95)=43.68ms)  ✓ 'rate>0.99' rate=100.00%
  run  4: exit=0   PASS  duration(max=44.73ms p(95)=43.28ms)  ✓ 'rate>0.99' rate=100.00%
  run  5: exit=99  FAIL  duration(max=604.48ms p(95)=359.69ms)  
  run  6: exit=0   PASS  duration(max=51.61ms p(95)=49.6ms)  ✓ 'rate>0.99' rate=100.00%
  run  7: exit=0   PASS  duration(max=356.65ms p(95)=218.55ms)  ✓ 'rate>0.99' rate=100.00%
  run  8: exit=0   PASS  duration(max=54.43ms p(95)=49.25ms)  ✓ 'rate>0.99' rate=100.00%
  run  9: exit=0   PASS  duration(max=57.22ms p(95)=53.9ms)  ✓ 'rate>0.99' rate=100.00%
  run 10: exit=0   PASS  duration(max=45.49ms p(95)=43.87ms)  ✓ 'rate>0.99' rate=100.00%
  run 11: exit=99  FAIL  duration(max=549.55ms p(95)=458.47ms)  
  run 12: exit=0   PASS  duration(max=52.13ms p(95)=49.93ms)  ✓ 'rate>0.99' rate=100.00%

  สรุปการรันซ้ำ 12 ครั้ง: PASS=9 FAIL=3

  นับรวมทุกการรันที่วัดในรอบนี้ (37 ครั้ง):

    ชุดที่ 1  การรัน --summary-mode full --summary-export    1 ครั้ง  ไม่ผ่าน 1
    ชุดที่ 2  รันซ้ำ 8 ครั้ง                                   8 ครั้ง  ไม่ผ่าน 0
    ชุดที่ 3  รันซ้ำ 15 ครั้ง                                 15 ครั้ง  ไม่ผ่าน 1
    ชุดที่ 4  การรันหลักในไฟล์นี้                             1 ครั้ง  ไม่ผ่าน 1
    ชุดที่ 5  รันซ้ำ 12 ครั้ง (ตารางด้านบน)                   12 ครั้ง  ไม่ผ่าน 3
                                                          -----------------
                                                          รวม 37 ครั้ง  ไม่ผ่าน 6

    อัตราที่ไม่ผ่าน = 6/37 = 16%  (ประมาณ 1 ใน 6 ครั้ง)
    ครั้งที่ไม่ผ่านมีค่าดังนี้: max=533.21ms, max=576.61ms, max=604.48ms, max=549.55ms
    และมีครั้งที่ p(95)=512.75ms
    ครั้งที่ผ่านมี max อยู่ราว 35-57 ms เป็นส่วนใหญ่

  ข้อสรุป: smoke test ล้มเหลวเป็นครั้งคราวโดยที่ระบบปลายทางไม่ได้มีปัญหา
  สาเหตุคือ smoke.js ใช้ vus=1 duration=10s และ sleep(1) จึงเก็บได้เพียงราว 10 รอบ (30 ข้อตรวจ)
  ขณะที่ mock server จงใจให้มีหางยาว 3% ที่บวกเพิ่ม 150-570 ms
  เมื่อมีคำขอใดคำขอหนึ่งเกิน 500 ms จะทำให้
    (1) check 'ตอบภายใน 500 ms' ตกไป 1 ข้อ จาก 30 ข้อ = 96.7% ต่ำกว่าเกณฑ์ 99%
    (2) และอาจทำให้ p(95) ของทั้งชุดเกิน 500 ms
  ผลคือ exit code 99 ซึ่งแปลว่า threshold ไม่ผ่าน ไม่ใช่ k6 หรือระบบพัง

  วิธีแก้ที่เสนอ: docs/CONTENT_REVIEW.md ข้อ 9.2
  สถานะ: ยังไม่ได้แก้ (ค้าง) — บันทึกไว้ตรงนี้เพื่อไม่ให้เข้าใจผิดว่าผ่านทุกครั้ง